app/controllers/user_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT "users".* FROM "users"
---
	def search
		@search = params[:search]

		if !params[:search].blank?
			@user = User.where(:id => params[:search])
		else
			@user = User.all

INSERT INTO "user_histories" ("terms", "user_id") VALUES ($1, $2) RETURNING "id"  [["terms", "Michael jackson"], ["user_id", 1]]
---
	def search_artist
		@search_artist = params[:search_artist]

		unless @search_artist.blank?
			UserHistory.create(user_id: current_user.id, terms: @search_artist)

SELECT  "user_histories".* FROM "user_histories"  WHERE "user_histories"."user_id" = 1  ORDER BY "user_histories"."id" DESC LIMIT 1
---
	def get_similar_artists
		@search_artist = UserHistory.where(user_id: current_user.id).last.terms

SELECT DISTINCT "user_histories"."terms" FROM "user_histories"  WHERE "user_histories"."user_id" = 1
---
	def search_history
		@artist_history = UserHistory.where(user_id: current_user.id).uniq.pluck(:terms)